---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.RelativeRoughness
source: html/d143e837-778b-fac4-5e78-ba9f620a73d2.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.RelativeRoughness Property

The relative roughness of the pipe.

## Syntax (C#)
```csharp
public double RelativeRoughness { get; set; }
```